a = 22
b = '43.0'
c = 30.99
n = 2 + 2j
print('Переменная a со значением', a, 'имеет тип: ', type(a))
print('Переменная b со значением', b, 'имеет тип: ', type(b))
print('Переменная c со значением', c, 'имеет тип: ', type(c))
print('Переменная n со значением', n, 'имеет тип: ', type(n))
m = c + a
h = complex(b) + n
k = a / 2
print('Переменная m со значением', m, 'имеет тип: ', type(m))
print('Переменная h со значением', h, 'имеет тип: ', type(h))
print('Переменная k со значением', k, 'имеет тип: ', type(k))
